In [1]:
n1=int(input("Enter Lower limit"))
n2=int(print("Enter Upper limit"))

Enter Lower limit11
Enter Upper limit

TypeError: int() argument must be a string, a bytes-like object or a number, not 'NoneType'

In [3]:
n1=int(input("Enter lower limit"))
n2=int(input("Enter Upper limit"))

Enter lower limit11
Enter Upper limit30

In [5]:
while n1<=n2:
    divisior=2
    flag=0
    while divisior<=n1-1:
        if n1%divisor==0:
            flag=1
            break
        divisior+=1
    if flag==0:
        print(n1,"is prime.")
    n1+=1

11 is prime.
13 is prime.
15 is prime.
17 is prime.
19 is prime.
21 is prime.
23 is prime.
25 is prime.
27 is prime.
29 is prime.

In [7]:
details=('Ankit',True,33,'ank@gmail')

In [8]:
type(details)

tuple

In [9]:
details_list=['ash',32,False,'ah@gmail.com']

In [10]:
details_list[1]=34

In [11]:
details_list

['ash', 34, False, 'ah@gmail.com']

In [12]:
details

('Ankit', True, 33, 'ank@gmail')

In [13]:
details[2]=32

TypeError: 'tuple' object does not support item assignment

In [14]:
details

('Ankit', True, 33, 'ank@gmail')

In [15]:
deails(0:1)

SyntaxError: invalid syntax (<ipython-input-15-9b2d3c1e39f0>, line 1)

In [16]:
details(0:3)

SyntaxError: invalid syntax (<ipython-input-16-ea01801eceee>, line 1)

In [17]:
details[0:2]

('Ankit', True)

In [18]:
list(details)

['Ankit', True, 33, 'ank@gmail']

In [19]:
temp=list(details)

In [20]:
temp

['Ankit', True, 33, 'ank@gmail']

In [21]:
temp[2]=34

In [22]:
temp

['Ankit', True, 34, 'ank@gmail']

In [23]:
details=tuple(temp)

In [24]:
details

('Ankit', True, 34, 'ank@gmail')

In [25]:
details_dictionary={'Fname':'Sham',
                    'Lname':'Singh',
                    'Age':33,
                    'Height':6.1}

In [26]:
details_dictionary

{'Fname': 'Sham', 'Lname': 'Singh', 'Age': 33, 'Height': 6.1}

In [27]:
deatils_dictionary['Fname']

NameError: name 'deatils_dictionary' is not defined

In [28]:
details_dictionary['Fname']

'Sham'

In [30]:
details_dictionary={'Fname':['Sham','Ram','tam'],
                    'Lname':['Singh','Saxena','Jain'],
                    'Age':[33,34,35],
                    'Height':[6.1,5.5,5.4]}

In [31]:
details_dictionary

{'Fname': ['Sham', 'Ram', 'tam'],
 'Lname': ['Singh', 'Saxena', 'Jain'],
 'Age': [33, 34, 35],
 'Height': [6.1, 5.5, 5.4]}

In [32]:
fname='Radha'
lname='patel'
age=22
height=5.4

In [33]:
details_dictionary['Fname'].append(fname)

In [34]:
details_dictionary

{'Fname': ['Sham', 'Ram', 'tam', 'Radha'],
 'Lname': ['Singh', 'Saxena', 'Jain'],
 'Age': [33, 34, 35],
 'Height': [6.1, 5.5, 5.4]}

In [35]:
import pandas as pd

In [37]:
pd.DataFrame(details_dictionary)

ValueError: arrays must all be same length

In [38]:
details_dictionary['Fname'].pop(3)

'Radha'

In [39]:
details_dictionary

{'Fname': ['Sham', 'Ram', 'tam'],
 'Lname': ['Singh', 'Saxena', 'Jain'],
 'Age': [33, 34, 35],
 'Height': [6.1, 5.5, 5.4]}

In [40]:
import pandas as pd

In [41]:
pd.DataFrame(details_dictionary)

  Fname   Lname  Age  Height
0  Sham   Singh   33     6.1
1   Ram  Saxena   34     5.5
2   tam    Jain   35     5.4

In [42]:
set1={1,1,2,2,2,3,4,5,5,6,6,7}
set2={6,6,8,8,99,99,12,14}

In [43]:
set1

{1, 2, 3, 4, 5, 6, 7}

In [44]:
set2

{6, 8, 12, 14, 99}

In [45]:
set1.intersection(set2)

{6}

In [47]:
set1.union(set2)

{1, 2, 3, 4, 5, 6, 7, 8, 12, 14, 99}

In [48]:
set1.difference(set2)

{1, 2, 3, 4, 5, 7}

In [49]:
pd.DataFrame(details_dictionary)

  Fname   Lname  Age  Height
0  Sham   Singh   33     6.1
1   Ram  Saxena   34     5.5
2   tam    Jain   35     5.4

In [50]:
details=pd.DataFrame(details_dictionary)

In [51]:
details

  Fname   Lname  Age  Height
0  Sham   Singh   33     6.1
1   Ram  Saxena   34     5.5
2   tam    Jain   35     5.4

In [52]:
details['City']=['Mumbai','Delhi','Mumbai']

In [53]:
details

  Fname   Lname  Age  Height    City
0  Sham   Singh   33     6.1  Mumbai
1   Ram  Saxena   34     5.5   Delhi
2   tam    Jain   35     5.4  Mumbai

In [54]:
set(City)

NameError: name 'City' is not defined

In [55]:
City=list(details['City'])

In [56]:
City

['Mumbai', 'Delhi', 'Mumbai']

In [57]:
set(City)

{'Delhi', 'Mumbai'}

In [58]:
details

  Fname   Lname  Age  Height    City
0  Sham   Singh   33     6.1  Mumbai
1   Ram  Saxena   34     5.5   Delhi
2   tam    Jain   35     5.4  Mumbai

In [61]:
details['Salary']=[100,200,300]
details['Previous Salary']=[98,192,292]

In [62]:
details

  Fname   Lname  Age  Height    City  Salary  Previous Salary
0  Sham   Singh   33     6.1  Mumbai     100               98
1   Ram  Saxena   34     5.5   Delhi     200              192
2   tam    Jain   35     5.4  Mumbai     300              292

In [65]:
details['Salary Difference']=details['Salary']-details['Previous Salary']

In [66]:
details

,Fname,Lname,Age,Height,City,Salary,Previous Salary,Salary Difference
0,Sham,Singh,33,6.1,Mumbai,100,98,2
1,Ram,Saxena,34,5.5,Delhi,200,192,8
2,tam,Jain,35,5.4,Mumbai,300,292,8

Strings

In [67]:
str1=('Justin')

In [68]:
str1

'Justin'

In [69]:
str1.Upper()

AttributeError: 'str' object has no attribute 'Upper'

In [70]:
str1

'Justin'

In [72]:
str1.upper()

'JUSTIN'

In [73]:
'ABC123'.isalpha()

False

In [74]:
"PipedPiper".index('p')

2

In [77]:
"PipedPiper".capitalize()

'Pipedpiper'

In [78]:
"PipedPiper".index('e')

3

In [79]:
email=input("Enter an email address")

Enter an email addressabc@gmail.com

In [80]:
email

'abc@gmail.com'

email.strip()

In [81]:
email.strip()

'abc@gmail.com'

In [82]:
len(email)

13

File Operations

In [84]:
f=open("Welcome.txt","w")
f.write("Welcome to Data Science course")
f.close()

In [85]:
content

NameError: name 'content' is not defined